{ "results": [
	{
        "Description": "Narrated 'Abdullah bin 'Amr Radhi Allahu Anhu The Prophet Sal-Allahu Alaihi Wasallam said, My Lake-Fount is (so large that it takes) a month's journey to cross it. Its water is whiter than milk, and its smell is nicer than musk (a kind of Perfume), and its drinking cups are (as numerous) as the (number of) stars of the sky; and whoever drinks from it, will never be thirsty.",
        "Hadith_Book": "Sahih Bukhari, Volume 8, Book 76, Number 581",
        "Title": "Abouot kauther",
        "createdAt": "2015-09-08T09:45:12.577Z",
        "objectId": "4FzuHFBgIU",
        "updatedAt": "2015-09-08T09:45:29.207Z"
    },
	{
        "Description": "It was narrated from Abu Hurairah radi allahu anhu that the Messenger of Allah said: Whoever can afford it but does not offer a sacrifice, let him not come near our prayer place.\"",
        "Hadith_Book": "Sunan ibn Majah, Vol4, #3123-Hasan",
        "Title": "About Qurbani",
        "createdAt": "2015-09-08T09:45:50.191Z",
        "objectId": "Aoph0xYwKf",
        "updatedAt": "2015-09-08T09:46:27.916Z"
    },
	{
        "Description": "Abdullah bin Buraidah narrated that his father said: The Messenger of Allah Peace be upon him Said between us and them (Hypocrites) is prayer; so whoever leaves it, he has committed Kufr.",
        "Hadith_Book": "Sunan Ibn Majah, Vol 1 , # 1079",
        "Title": "About Prayer",
        "createdAt": "2015-09-08T09:46:52.348Z",
        "objectId": "JOj81CkMD9",
        "updatedAt": "2015-09-08T09:47:08.633Z"
    },
	{
        "Description": "Narrated Abis bin Rabia Radi Allahu Anhu : Umar Radi Allahu Anhu  came near the Black Stone (Hajr-e-Aswad) and kissed it and said  No doubt, I know that you are a stone and can neither benefit anyone nor harm anyone. Had I not seen Allah's Apostle Peace be upon him kissing you I would not have kissed you.",
        "Hadith_Book": "Sahih Bukhari, Book 26, 667",
        "Title": "About Hajr-e-Aswad)",
        "createdAt": "2015-09-08T09:44:29.196Z",
        "objectId": "VDJgZ8huY4",
        "updatedAt": "2015-09-08T09:47:14.276Z"
    }
] }
